controllers/AnimalzooController.php

public function actionAddAnimals()
    {  $query = new Query();
        $model  = new Animals();
        $model2= new Zoo();
        $list = ArrayHelper::map(Zoo::find()->where(['activity' => '1'] )->all(), 'zoo_id', 'zoo_name');
        if ($this->request->isPost) {
            $array = $this->request->post();
            $array2 = $this->request->post('Zoo');

            $zooId=$array2['zoo_name'];

            $model->load($array);
            if ($model->validate()) {
                $model->save();
            }

        $animalId = $query->select(" LAST_INSERT_ID() as aid")->one();
        $data = $animalId['aid'];


        $query->createCommand()->insert('animal_zoo_map',['animals_id' => $data , 'zoo_id' => $zooId])->execute();

        }

        $sql=Animals::find()->where(['activity'=>1])->all();
---
SELECT * FROM `zoo` WHERE `activity`='1'
SELECT * FROM `animals` WHERE `activity`=1