controllers/UserController.php

    public function actionEditUser($id)
    {
        $model = user::find()->where(['user_id' => $id])->one();

        // $model  = new user();
        if ($this->request->isPost) {
            $array = $this->request->post();
            $model->load($array);
            if ($model->validate()) {
                $model->save();
---
UPDATE `user` SET `activity`=0 WHERE `user_id`='53'