controllers/ZooController.php

SELECT * FROM `zoo` WHERE `activity`=1
---
    public function actionViewZoo()
    {
        $sql=Zoo::find()->where(['activity'=>1])->all();

SELECT * FROM `zoo` WHERE `activity`=1
---
    public function actionAddZoo()
    {
        $model  = new Zoo();
        if ($this->request->isPost) {
            $array = $this->request->post();
            $model->load($array);
            if ($model->validate()) {
                $model->save();
                // return $this->redirect('viewzoo');
            }

        }
        $sql=Zoo::find()->where(['activity'=>1])->all();